app/controllers/courses_controller.rb

SELECT  `courses`.* FROM `courses` WHERE `courses`.`COURSE_ID` = 2 LIMIT 1
---
    def set_course
         @course = Course.find(params[:id])