app/controllers/departments_controller.rb

  def set_department
    @department = Department.find(params[:id])
---
SELECT  `departments`.* FROM `departments` WHERE `departments`.`department_id` = NULL LIMIT 1