app/controllers/students_controller.rb

    def change_dep_id
        department = Department.find_by_department_id(params[:foo_param])
        stude = Student.find_by_STUDENT_ID(params[:stud_param])
---
SELECT  `departments`.* FROM `departments` WHERE `departments`.`department_id` = 1 LIMIT 1
SELECT  `students`.* FROM `students` WHERE `students`.`STUDENT_ID` = 1 LIMIT 1

    def set_student
        @student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`STUDENT_ID` = 1 LIMIT 1